src/cf/InformationRegisters/GDS_ВыработкаПоПоследнемуТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ВыработкаПоПоследнемуТО</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МЧВО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Одометр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МЧДВС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/GDS_ДополнительныеФункции/Ext/Module.bsl
&НаСервере
Функция ПроверитьДоступностьРоли(ТекРоль) Экспорт
	
	Возврат РольДоступна(ТекРоль);

	//Если Пользователь = Неопределено Тогда
	//	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	//КонецЕсли;
	//Запрос = Новый Запрос;
	//Запрос.Текст = "
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//| 	1
	//|ИЗ
	//|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	//|	ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	//|ГДЕ
	//|	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
	//|  	И ГруппыДоступаПользователи.Пользователь = &Пользователь";
	//Запрос.УстановитьПараметр("Пользователь", Пользователь);
	//Запрос.УстановитьПараметр("Роль", ИмяРоли);
	//УстановитьПривилегированныйРежим(Истина);
	//РезультатЗапроса = Запрос.Выполнить();
	//УстановитьПривилегированныйРежим(Ложь);
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат Ложь;
	//Иначе
	//	Возврат Истина;
	//КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьПоследниеПоказанияНаработкиПоТС(ТС, ВидОбслуживания, ПериодДанных) Экспорт
	
	Показания = Новый Структура;
	Показания.Вставить("МЧВО", 0);
	Показания.Вставить("Одометр", 0);
	Показания.Вставить("МЧДВС", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GDS_ВыработкаПоПоследнемуТОСрезПоследних.МЧВО КАК МЧВО,
	|	GDS_ВыработкаПоПоследнемуТОСрезПоследних.Одометр КАК Одометр,
	|	GDS_ВыработкаПоПоследнемуТОСрезПоследних.МЧДВС КАК МЧДВС
	|ИЗ
	|	РегистрСведений.GDS_ВыработкаПоПоследнемуТО.СрезПоследних(
	|			&Период,
	|			ТранспортноеСредство = &ТранспортноеСредство
	|				И ВидОбслуживания = &ВидОбслуживания) КАК GDS_ВыработкаПоПоследнемуТОСрезПоследних";
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТС);
	Запрос.УстановитьПараметр("ВидОбслуживания", ВидОбслуживания);
	Запрос.УстановитьПараметр("Период", ПериодДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Показания.МЧВО = Выборка.МЧВО;
		Показания.Одометр = Выборка.Одометр;
		Показания.МЧДВС = Выборка.МЧДВС;
	КонецЕсли;
	
	Возврат Показания;
	
КонецФункции

&НаСервере
Функция ВернутьСреднююЦенуНоменклатуры(Номенклатура) Экспорт 
	
	//Если GDS_ФункцииОбмена.ПроверкаНаРабочуюБД() Тогда
		СоединениеWS = GDS_ФункцииОбмена.ПолучитьДанныеОWS_БП();
		
		Данные = СоединениеWS.ВернутьДанныеПоЗапросу("Номенклатура",строка(Номенклатура.Ссылка.УникальныйИдентификатор()));
		
		XML_Строка = Данные.Получить();
		
		СписокПолученныхДанных = GDS_ФункцииОбмена.РазобратьПолученныеДанные(XML_Строка);
		
		ЦенаНоменклатуры = СписокПолученныхДанных[0].Значение.Цена;
		
		Если ЦенаНоменклатуры = "" Тогда
			Возврат 0;	
		КонецЕсли;
		
		Возврат Число(ЦенаНоменклатуры);
	//КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПоказатьВременнуюТаблицу(МенеджерВременныхТаблиц, ИмяВременнойТаблици) Экспорт
 	  
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	| *
	|ИЗ
	| ВременнаяТаблица КАК ВременнаяТаблица";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВременнаяТаблица", ИмяВременнойТаблици); 
	ВременнаяТаблица = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ВременнаяТаблица; 
	
	// Пример
	//GDS_ДополнительныеФункции.ПоказатьВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"ВТНачисления") Результат.НайтиСтроки(Новый Структура("ФизическоеЛицо", Справочники.ФизическиеЛица.НайтиПоНаименованию("Белоус Ирина Александровна")))

КонецФункции

&НаСервере
Функция ПечатьИзВПФ(ИмяВПФ, ИмяМакета, МассивОбъектов, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	СсылкаНаВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ИмяВПФ);

	Если СсылкаНаВПФ.Пустая() Тогда
	    Сообщить("В справочнике ""Дополнительные отчеты и обработки"" не найдена внешнюю печатную форму с наименованием '" + ИмяВПФ + "'");
	    Возврат ТабличныйДокумент;
	КонецЕсли;
	
	Попытка
	    ОбработкаОбъект = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(СсылкаНаВПФ);
	Исключение
	    Сообщить("Не удалось напечатать """ + ИмяВПФ + "'"". Ошибка создания объекта дополнительной ПФ");
	    Возврат ТабличныйДокумент;
	КонецПопытки;
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(МассивОбъектов);
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(ИмяМакета);
	//ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	Попытка
		ТабличныйДокумент = ОбработкаОбъект.СформироватьПечатнуюФорму(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыПечати);
	Исключение
		Сообщить("Не удалось напечатать """ + ИмяВПФ + "'""." + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки; 
	
    Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Процедура ПроверкаАвторизацииДляЗапуска() Экспорт
	
	ИмяПользователяДО = Константы.ИнтеграцияС1СДокументооборотИмяПользователяДляОбмена.Получить();
	ПарольДО = Константы.ИнтеграцияС1СДокументооборотПарольДляОбмена.Получить();
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьНастройкиАвторизацииВПараметрыСеанса(
		ИмяПользователяДО,
		ПарольДО,
		Ложь,
		Ложь);
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьВерсиюСервисаВПараметрыСеанса();
	
КонецПроцедуры
